JarneMeylemans/PE2-JarneMeylemans-Lasergun/Project_Code/STM32F4/PE_LASERGUN_CODE_2apr/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RED_LED_Pin GPIO_PIN_0
#define RED_LED_GPIO_Port GPIOA
#define BAT_ADC_Pin GPIO_PIN_1
#define BAT_ADC_GPIO_Port GPIOA
#define TRIGGER_Pin GPIO_PIN_7
#define TRIGGER_GPIO_Port GPIOA
#define PWM38k_IR_Pin GPIO_PIN_12
#define PWM38k_IR_GPIO_Port GPIOB
#define UART_IR_Pin GPIO_PIN_6
#define UART_IR_GPIO_Port GPIOC
#define ROT_SW_Pin GPIO_PIN_9
#define ROT_SW_GPIO_Port GPIOC
#define ROT_A_Pin GPIO_PIN_8
#define ROT_A_GPIO_Port GPIOA
#define ROT_B_Pin GPIO_PIN_9
#define ROT_B_GPIO_Port GPIOA
#define IR_REC1_Pin GPIO_PIN_10
#define IR_REC1_GPIO_Port GPIOC
#define IR_REC2_Pin GPIO_PIN_11
#define IR_REC2_GPIO_Port GPIOC
#define IR_REC3_Pin GPIO_PIN_12
#define IR_REC3_GPIO_Port GPIOC
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
